Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: རྣམ་དག་སྤྱན་ཁྱོད་འཁྲུངས་པར་མ་གྱུར་པས། །ཆབ་ཀླུང་ཀུན་ཀྱང་མ་ལུས་སྐམས་པར་གྱུར། །
en: {26} “ ‘When you, who have pure eyes, had not been born, Every river, without exception, had dried up.

source: བཟའ་ཤིང་ར་བ་ཀུན་ཀྱང་རི་དགོན་འདྲ། །རུས་པ་དཀར་པོས་དོག་ས་གཏམས་པར་གྱུར། །
en: All orchards resembled desolate mountains, And the ground was covered with white bones.

source: གང་ཚེ་ཁྱོད་ལ་སློང་བ་མང་འདུས་ཏེ། །སློང་བ་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་མཛད་ནས། །ཕྱོགས་བཞི་ཀུན་ནས་སྤྲིན་ཆེན་འདུས་པར་གྱུར། །ཐང་དང་གཤོང་རྣམས་ཀུན་ཀྱང་ངོམས་པར་བགྱིས། །
en: {27} “ ‘When you gathered together a multitude of supplicants And brought satisfaction to all those supplicants, Great clouds gathered from all four directions, Bringing satisfaction to all plains and lowlands.

source: སླན་ཅད་རྐུན་ཆོམ་གཡོན་ཅན་ཆད་པར་གྱུར། །
en: {28} “ ‘Since then there has been no thieving, robbery, or fraud.

source: དགུམ་པ་མ་མཆིས་སུའང་གཟུང་མ་མཆིས། །
en: There has been no murder and no executions.

source: མགོན་མེད་གང་ཡང་འགུམ་པར་མི་འགྱུར་ཏེ། །
en: No one has died because they had no protector.

source: ཁྱོད་ནི་འགྲོ་བ་མགོན་མེད་ཀུན་གྱི་སྐྱབས། །
en: You have become the protector for all beings who have none.

source: སྲོག་གཅོད་པ་ལ་མངོན་པར་མོས་པའི་མྱི། །གཞན་རྣམས་བཀུམ་ཞིང་དེ་ཡི་ཁྲག་འཚལ་ལ། །གཅིག་ལ་གཅིག་གི་ཤ་འཚལ་གྱུར་པ་དག །ཁྱོད་ཀྱི་སྦྱིན་པ་ཆེན་པོས་བྱམས་སེམས་གྱུར། །
en: {29} “ ‘Those humans who delighted in killing, Who slew others and then drank their blood, And those who ate one another’s flesh, Through your great generosity now have benevolent minds.

source: བརྒྱ་སྟོང་གྲངས་སུ་འགྲངས་པར་གྱུར་པ་ལས། །
en: {30} “ ‘At that time, those who possessed clothes Numbered no more than one hundred thousand.

source: དེ་ཚེ་འགའ་ཞིག་རད་པ་འཚལ་གྱུར་གྱིས། །གཞན་ནི་རྩྭ་དང་ལོ་མར་ད་འཚལ། །དེ་ཚེ་ཀུན་ཀྱང་ཡི་དགས་བཀྲེས་མནར་བཞིན། །
en: The others covered their bodies with clothing of straw and leaves, And at that time, all were tormented by hunger as pretas are.

source: འགྲོ་བ་མགོན་མེད་མགོན་དུ་ཁྱོད་འཁྲུངས་ནས། །
en: {31} “ ‘You were born as a protector for those without a protector.

source: ས་བོན་མ་བཏབ་མ་རྨོས་འབྲས་ཀྱང་བྱུང་། །
en: Now even rice grows without being planted, without plowing.

source: དཔག་བསམ་ཤིང་ལས་མཛོད་རྣམས་རྣམ་པར་འཐོན། །སྐྱེས་པ་བུད་མྱེད་མཁས་པ་གདའ་བར་གྱུར། །
en: Treasures are obtained from wish-fulfilling trees, And men and women have become learned.

source: ཟླ་བ་ཟླ་ཕྱེད་དོན་དུ་སྔོན་ཅད་ནི། །ལམ་ནོར་གནས་པ་སྩོགས་ཤིང་སྲི་ཞུར་བགྱིད། །
en: {32} “ ‘In the past, for a month or half a month they would Follow bad ways, working to accumulate to no avail.

source: དེང་སང་རད་པ་རབ་འཚལ་རྒྱན་མང་ལྡན། །དགའ་བའི་གནས་ན་རྩེ་བའི་ལྷ་ཡང་འདྲ། །
en: But nowadays they have much jewelry and excellent clothing And are always happy, like devas amusing themselves.

source: སླན་ཆད་ལོག་པ་རྣམས་ལ་མི་ཟད་ཞུགས། །ཆོས་ངན་འདོད་ཆགས་མྱི་རྣམས་ཞེན་ཅིང་ཆགས། །ན་ཆུང་གཞོན་ནུ་གཞན་གྱིས་བསྲུངས་པ་རྣམས། །ནན་གྱིས་ཕྲོགས་རློམ་ཆབ་འཚལ་མ་རུངས་བགྱིས། །
en: {33} “ ‘Previously, passionate men, with dreadful wrong conduct, Because of their desires and contrary to the Dharma, Would forcefully take away and rape young maidens Who were under the protection of others.

source: ལྷ་མོ་བཟང་མོའི་ཁ་དོག་གཟུགས་ལྡན་པ། །ཆ་གོས་བཟང་རྒྱན་ལྡན་པ་དེང་སང་མཐོང་གྱུར་ཏེ། །གཞན་གྱི་བུད་མེད་སྤོས་དྲི་གདའ་མཆིས་ཀྱང་། །དགའ་ལྡན་ཇི་བཞིན་མཆིས་འབྲད་རྒྱན་གྱིས་འཚལ། །
en: {34} “ ‘Today, just on seeing the perfumed wives of others, With the bodies and complexions of beautiful apsarases, Wearing splendid clothes and adorned in jewelry, They become satisfied as if by their own wives in Tuṣita.

source: ཤོ་བེ་བརླང་བ་ཕྲ་མ་ཀྱལ་པ་རྣམས། །
en: {35} “ ‘In the past, people spoke for the purpose of deception.

source: སྔན་ཅད་གཡོ་སྒྱུའི་དབང་གིས་ངག་ཏུ་བརྗོད། །
en: They lied, spoke harshly, slandered, and spoke meaninglessly.

source: དེང་སང་ཚིག་གི་ནོངས་པ་བཞི་སྤངས་ཤིང་། །ལྟ་བ་ངན་སྤངས་ཆོས་ལ་ཀུན་ཀྱང་སྤྱོད། །
en: Nowadays they have abandoned those four faults of speech, Have abandoned wrong views, and completely practice the Dharma.

source: ཚངས་དབྱངས་ཀ་ལ་པིང་ཀའི་སྒྲར་འབྱུང་བའི། །ཁྱོད་ཀྱི་གསུང་མཆོག་འདི་ཡི་ཆ་ཤས་ལའང་། །རོལ་མོ་སྒྲ་དབྱངས་ཤིན་ཏུ་སྙན་པ་དང་། །ལྷ་རྫས་གླུ་དབྱངས་འདི་དག་ཉེར་མྱི་འགྱུར། །
en: {36} “ ‘Even the most melodious music And this divine singing do not come close To a fraction of your supreme speech, Which emerges as the sound of Brahmā’s voice or of the avadavat.

source: ཁྱོད་ཀྱི་སྤྱི་གཙུག་དབུ་སྟེང་གདུགས་ལྡིང་བ། །རིན་ཆེན་རྒྱུས་བགྱིས་གསེར་གྱི་དྲ་བས་བཀབ། །དཔལ་གྱི་སྙིང་མཛོད་ཡུ་བ་བཻཌུརྱ། །ཀུན་ནས་རིན་ཆེན་མཆོག་གི་དྲིལ་གྱིས་འཁོར། །
en: {37} “ ‘Above the crown of your head floats a parasol Made of precious materials and covered by a net of gold, With a glorious center of treasure and a handle of beryl And encircled by completely precious, excellent bells.

source: དྲིལ་ལས་བྱུང་བའི་སྒྲས་ཀྱང་མ་ལུས་པའི། །འཇིག་རྟེན་སྒྲ་དབྱངས་མ་ལུས་ཟིལ་མནན་ཅིང་། །
en: {38} “ ‘All the sounds that come from those bells Outshine all the music in this world.

source: སངས་རྒྱས་གསུང་གི་ཡན་ལག་འདྲ་བར་འཁྲོལ། །དམ་པའི་ཆོས་ཀྱི་སྒྲ་དབྱངས་ཞི་བ་སྒྲོག །
en: They emit sounds like the aspects of the Buddha’s speech, Resounding with the peaceful sounds of the Dharma.

source: དེ་ཐོས་སེམས་ཅན་ཉོན་མོངས་ཞི་བར་བགྱིད། །མ་ལུས་ཕྱོགས་ཀྱི་ཞིང་རྣམས་བརྒྱུད་པ་ཡི། །བསྐལ་པ་རྒྱ་མཚོའི་བདེ་གཤེགས་རྒྱ་མཚོ་དང་། །བློ་ལྡན་རྒྱ་མཚོའི་མཚན་གྱི་འཁོར་ལོ་རྣམས། །
en: {39} “ ‘The kleśas cease in all beings who hear The wheels of the names of the ocean of wise ones, Of the ocean of sugatas in the ocean of successive kalpas In the realms in all directions, without exception.

source: སྔོན་མཐའི་ཞིང་རྣམས་གཅིག་ནས་གཅིག་བརྒྱུད་དུ། །གང་མཚན་གང་དང་གང་ལགས་རིམ་བཞིན་དང་། །མ་ལུས་ཕྱོགས་སུ་དམ་ཆོས་འཁོར་ལོ་ཡང་། །ཁྱོད་ཀྱི་བྱིན་གྱིས་དྲིལ་རྣམས་རབ་ཏུ་སྒྲོག །
en: {40} “ ‘Through your blessing, the bells sound out In correct sequence whatever the names Of those who have appeared in the past, in one realm after another, And turned the wheel of the Dharma in all directions without exception.

source: ཁྱོད་ཀྱི་དྲིལ་སྒྲ་ཐོགས་པ་མ་མཆིས་པར། །ཚངས་དབང་ལྷ་དབང་འགྲོ་བའི་བདག་པོ་རྣམས། །རང་རང་ལས་ཀྱི་ཚུལ་ནི་ཀུན་བརྗོད་ཅིང་། །འཛམ་བུའི་རྒྱལ་མཚན་ཁྱབ་པར་ཀུན་ཏུ་སྒྲོག །
en: {41} “ ‘For as long as your bells continue to ring, They will resound throughout Jambudhvaja, Describing the nature of the karma of each one Of the lords of Brahmās, the lords of devas, and the lords of humans.

source: དྲིལ་གྱི་སྒྲ་ལས་ལྷ་དང་མི་རྣམས་ཀྱིས། །རང་རང་ལས་ཀྱི་ཚུལ་རྒྱུད་ཐོས་གྱུར་ནས། །སྡིག་ཏོ་རྣམས་སྤངས་དགེ་བ་སྤྱོད་པར་གྱུར། །སངས་རྒྱས་བྱང་ཆུབ་མཆོག་ལ་ཀུན་ཀྱང་གནས། །
en: {42} “ ‘From the sound of the bells, each deva and human Hears the nature of their individual karma, So they give up bad actions, adopt good conduct, And are all directed to the supreme enlightenment of buddhahood.

source: ཁྱོད་ཀྱི་ཡབ་ནི་མི་བདག་སྐར་མའི་འོད། །དེ་ཡི་བཙུན་མོ་པདྨོ་ཁྱོད་ཀྱི་ཡུམ། །
en: {43} “ ‘Your father was the sovereign over humans, Jyotiṣprabha, And his Queen, Padmaprabhā, was your mother.

source: རྙོག་པ་ལྔ་རྣམས་ཤིན་ཏུ་རྒྱས་གྱུར་དུ། །ཆོས་འགྲིབ་རྒྱལ་སྲིད་དེས་ནི་བཞེས་པར་གྱུར། །
en: In the time when the five deteriorations spread, He had inherited the Dharma kingdom.

source: དེ་ཡི་བཟའ་ཤིང་ར་བ་ཡངས་བྱུང་བ། །མེ་ཏོག་རྒྱས་བརྒྱན་རིན་ཆེན་སྒྲོན་མ་སྟེ། ཤིང་མང་བརྒྱས་བསྐོར་རྫིང་བུ་ལྔ་བརྒྱ་ཡིས། །དེ་ནི་ཤིན་ཏུ་བརྒྱན་པ་བྱུང་བར་གྱུར། །
en: {44} “ ‘His royal gardens were vast, Arrayed with blossoming flowers and precious lamps, Beautified by five hundred lotus ponds, Encircled by many hundreds of trees.

source: དེ་དག་སོ་སོ་རེ་རེའི་ངོགས་སུ་ཡང་། །ཀ་བ་སྟོང་ལྡན་གཞལ་མེད་ཁང་བཟངས་བྱུང་། །སྟེགས་བུ་བཟང་པོ་སྣ་ཚོགས་སྟོང་གིས་བརྒྱན། །ཟླ་གམ་དྲ་བས་ཀུན་ནས་མཛེས་པར་བགྱིས། །
en: {45} “ ‘And each of them had on every side A palace with a thousand pillars, A variegated array of a thousand balconies, And beautifying nets of crescents everywhere.

source: ཆོས་ངན་སྟོབས་ནི་རབ་ཏུ་འཕེལ་གྱུར་པས། །དགུང་ལོ་མང་པོར་དགུང་ཆར་བབ་མ་གྱུར། །
en: {46} “ ‘The power of bad qualities became widespread, So that for many years the rain did not fall.

source: རྫིང་བུ་ཀུན་གྱི་ཆབ་དང་ཞུགས་ཤིང་རྣམས། །དེ་ཚེ་ལོ་མ་མདོག་དང་བཅས་ཏེ་སྐམས།
en: At that time, the water in all the lotus ponds, And the trees with all their leaves, dried up.

source: དགུང་བདུན་ན་ནི་ཁྱོད་བལྟམ་གྱུར་པའི་ཚེ། །དེ་ཚེ་ངོ་མཚར་རྨད་བྱུང་ལྟས་བྱུང་སྟེ། །
en: {47} “ ‘For seven nights before you were born, There were marvelous, wonderful omens.

source: དེ་དག་མཐོང་ནས་སེམས་ཅན་ངེས་རྟོགས་པར། །བདག་ཅག་སྐྱོབ་པ་ངེས་པར་འབྱུང་ཞེས་མཆིས། །
en: When beings saw them, they said with certainty, “Our savior has definitely arrived.”

source: དགུང་གི་གུང་ལ་བབ་ནས་རྣམ་དྲུག་དུ། །ཁམས་ཀྱི་དོགས་ཡོངས་སུ་གཡོས་པར་གྱུར། །
en: {48} “ ‘At the midnights of those nights, The entire surface of the world shook in six ways.

source: མ་སྨད་ཤིན་ཏུ་བཟང་བའི་རྫིང་དེ་ཡི། །དབུས་སུ་གདུགས་དང་མཉམ་པའི་འོད་ཅིག་བྱུང་། །
en: In the center of the supreme lotus pond, There appeared a light as bright as the sun.

source: ཆབ་བཟང་ཡན་ལག་བརྒྱད་ལྡན་རྒྱས་པར་གྱུར། །རྫིང་བུ་ལྔ་བརྒྱ་ཀུན་ཀྱང་དེ་བཞིན་ཏེ། །
en: {49} “ ‘All five hundred lotus ponds were filled With excellent water that had the eight qualities.

source: ཞུགས་ཤིང་ཀུན་ཀྱང་ལོ་མ་འཁྲུངས་པར་གྱུར། །མེ་ཏོག་འབྲས་བུ་ཁ་དོག་མདོག་དང་ལྡན། །
en: On the branches of the trees grew leaves And magnificent flowers and fruits.

source: རྫིང་བུ་དེ་རྣམས་ཆབ་ཀྱིས་བལྟམ་གྱུར་པས། །ནགས་ཚལ་མ་ལུས་དེ་དག་ངོམས་པར་བགྱིས། །
en: {50} “ ‘Those lotus ponds filled with water Satisfied entire forests without exception.

source: ཆབ་ཆེན་དེ་ལས་བྱུང་བའི་རྒྱུད་འཕྲོས་པས། །འཛམ་བུའི་རྒྱལ་མཚན་ཆབ་ཀྱིས་བལྟམ་པར་གྱུར། །
en: The great rivers that flowed from them Filled Jambudhvaja with their water.

source: ཞུགས་ཤིང་སྨན་དང་ལོ་ཐོག་ལྡུམ་བུ་ཡང་། །
en: {51} “ ‘The trees, herbs, crops, and plants grew.

source: འཁྲུངས་གྱུར་ཞུགས་ཤིང་མེ་ཏོག་འབྲས་བུ་རྒྱས། །
en: Trees were covered with flowers and fruits.

source: དོག་སའི་སྟེང་ན་མཆིས་དགུའི་ས་བོན་རྣམས། །ཀུན་ཀྱང་ཆབ་ཀྱིས་བརླན་པས་རྣམ་པར་འཁྲུངས། །
en: The many kinds of seeds on the surface of the world Were all moistened by the water and sprouted.

source: ཆབ་ཀྱིས་བདས་གྱུར་དོག་སའི་ཕྱོགས་རྣམས་ཀྱང་། །དེ་ཚེ་ཐམས་ཅད་རབ་ཏུ་མཉམ་པར་གྱུར། །
en: {52} “ ‘The surface of the earth was saturated with water, So at that time it became completely level.

source: སྒང་གཤོང་དོག་སའི་ཕྱོགས་རྣམས་ཇི་སྙེད་པ། །
en: All the upland and downland in all directions On the world’s surface became level.

source: དེ་དག་ཀུན་ཀྱང་དེ་ཚེ་མཉམ་པར་གྱུར། །གཡང་ས་གྲོག་པོ་མི་བདེ་ཕྱོགས་ཀྱི་རྣམས། །དེ་ཚེ་ཡུད་ཀྱིས་ཀུན་ཀྱང་མཉམ་པར་གྱུར། །ཚེར་མ་གསེག་མ་ལ་སྩོགས་མ་མཆིས་གྱུར། །
en: {53} “ ‘At that time, chasms, precipices, and rugged places All became level, everywhere in an instant.

source: རིན་ཆེན་བཟང་པོའི་འབྱུང་གནས་ཡོངས་སུ་འཐོན། །
en: Thorns and pebbles and so on ceased to exist, And sources of excellent jewels appeared.

source: སྐྱེས་པ་བུད་མེད་ཚོགས་རྣམས་དགའ་བར་གྱུར། །སྐོམ་པས་གདུངས་བ་ཀུན་ཀྱང་ཆབ་ལ་འཚལ། །
en: {54} “ ‘Crowds of men and women were rapturous, And all who were afflicted by thirst had plenty of water.

source: ཀྱེ་མ་དེ་རིང་བདེ་ན་སུ་མཐུ་ཤེས། །སྙན་པར་བརྗོད་པ་དེ་སྐད་ཆད་ཏུ་བརྗོད། །
en: With happy voices they cried out in joy, “Ah! Through whose power has today’s happiness come?”

source: དོག་སའི་མངའ་བདག་སྐར་འོད་སྲས་དང་བཅས། །སྲས་མོ་བློན་པོའི་ཚོགས་བཅས་དེ་ཡི་ཚེ། །སྐྱེ་བོ་བྱེ་བ་སྟོང་གིས་ཡོངས་བསྐོར་ཏེ། །བཟའ་ཤིང་ར་བར་དགྱེས་པར་གཤེགས་པ་མཛད། །
en: {55} “ ‘At that time, the ruler of the earth, Jyotiḥprabha, and his son, Together with his daughters and a crowd of his ministers And encircled by a thousand million people, Proceeded to the gardens with delight.

source: མདངས་དགའ་རྫིང་ཆེན་ཡོངས་སུ་མ་སྨད་པ། །སྤོས་ཆུས་བལྟམས་པ་དབུས་ན་མཆིས་གྱུར་པའི། །དེ་ཡི་དབུས་སུ་ཆོས་སྟེགས་བཟང་པོ་ཡི། །ཕོ་བྲང་སྟེང་གཤེགས་བཙུན་མོ་བཅས་པར་བཞུགས། །
en: {56} “ ‘Together with his queen he came up onto The terrace of the staircase of righteousness Of the charming, preeminent, central Lotus pond filled with scented water.

source: དགུང་བདུན་ལོན་པར་གྱུར་ནས་དེ་ཡི་ཆབ། །དགུང་གི་གུང་ལ་གྱེན་དུ་ལུད་པར་གྱུར། །རི་དང་གཞལ་མེད་ཁང་གི་ཕྲེང་བཅས་པའི། །དོག་སའང་དེ་ཚེ་ཡོངས་སུ་གཡོས་པར་གྱུར། །
en: {57} “ ‘For the duration of seven nights, Each night the water rose upward, And at that time the entire surface of the earth, With its mountains and garlands of palaces, was shaken.

source: ཡོངས་སུ་མ་སྨད་དེ་ཡི་དབུས་ནས་ཀྱང་། །པདྨོ་ཆེན་པོ་ལོ་མ་སྟོང་ལྡན་འཁྲུངས། །གདུགས་སྟོང་མདོག་གསལ་སྤྲིན་གྱི་དྲ་བ་ཅན། །རི་རབ་རྩེ་མོ་མན་ཅད་འོད་ཀྱིས་འགེངས། །
en: {58} “ ‘In the center of the preeminent pond Appeared a great lotus with a thousand petals And a net of clouds of the light of a thousand suns Spreading upward as far as Sumeru’s summit.

source: ཆུ་བ་རྡོ་རྗེ་ནང་རིམ་དྲི་གདའ་སྟེ། །
en: {59} “ ‘It had a diamond stem and an aromatic center.

source: རིན་ཆེན་དབང་པོའི་ལོ་མ་རྣམ་དག་ཡངས། །
en: Its multitude of pure petals were lords of jewels.

source: འཛམ་བུ་ཆུ་ཀླུང་གསེར་བཟང་སྙིང་པོ་ཅན། །
en: Its pericarp was splendid Jambu River gold.

source: ཟེ་བ་སྤོས་རབ་འབར་བ་ཕུན་སུམ་ཚོགས། །
en: It had a perfection of bright stamens with an excellent aroma.

source: མགོན་པོ་ཁྱོད་ནི་དེ་ཡི་སྙིང་པོ་ལས། །
en: {60} “ ‘You, lord, were born upon that pericarp.

source: སྐྱིལ་མོ་ཀྲུང་བཅས་སྐུ་ནི་བྱུང་བར་གྱུར། །མཚན་གྱིས་རྣམ་བརྒྱན་ཡན་ལག་ཤིན་ཏུ་མཛེས། །ལྷ་མང་བརྒྱས་ཀྱང་མངོན་པར་མཆོད་པ་བགྱིས། །
en: You appeared sitting cross-legged, Your beautiful body adorned by the signs of a great being, With hundreds of devas making offerings to you.

source: རྒྱལ་པོ་ཕོ་བྲང་སྟེང་ནས་ཤོད་གཤེགས་ཏེ། །
en: {61} “ ‘The king descended from the terrace’s platform.

source: ཕྱག་གཉིས་བརྐྱང་སྟེ་ལེགས་པར་ཁྱོད་བླངས་ནས། །བཙུན་མོའི་མགོ་ལ་བཞག་སྟེ་འདི་སྐད་གསུངས། །
en: He reached out with his arms and lifted you up, Gave you to the supreme queen, and said these words: “This is your son!

source: ཁྱོད་ཀྱི་བུ་འདི་ཡིན་གྱིས་དགར་གྱིས་ཤིག །
en: Be of happy mind!”

source: འཇིག་རྟེན་མགོན་ཁྱོད་དེ་ལྟར་བལྟམས་གྱུར་ཚེ། །བྱེ་བའི་གཏེར་རྣམས་རབ་ཏུ་འཐོན་པར་གྱུར། །ཞུགས་ཤིང་ཀུན་ཀྱང་མངོན་པར་ཁ་འབུས་ཏེ། །སྟེང་གི་མཁའ་ལས་རོལ་མོའི་སྒྲ་ཡང་བྱུང་། །
en: {62} “ ‘When you, protector of the world, were thus born, Ten million treasures appeared, The buds of all trees opened, And the sound of music came from the sky.

source: འཛམ་བུ་རྒྱལ་མཚན་སེམས་ཅན་ཐམས་ཅད་ཀྱང་། །ཁྱོད་ལ་མངོན་ལྟ་བཏུད་ཅིང་ཕྱག་ཀྱང་འཚལ། །
en: {63} “ ‘All the beings in Jambudhvaja Gazed upon you, bowed, and paid homage.

source: ཐལ་མོ་སྦྱར་ཅིང་ཀྱེ་མ་མགོན་མེད་པའི། །མགོན་ཞིག་བྱུང་ཞེས་དགའ་བའི་ཚིག་ཀྱང་བརྗོད། །
en: With palms together they said with joy, “Oh! You have come as a protector for the helpless!”

source: ཁྱོད་ཀྱི་སྐུ་ལས་འོད་གཟེར་མང་བྱུང་བས། །དོག་ས་ཀུན་ཏུ་རབ་ཏུ་སྣང་བར་གྱུར། །འགྲོ་བའི་མུན་པ་ཀུན་ཀྱང་རྣམ་བསྩལ་ནས། །ནད་མང་མ་ལུས་རབ་ཏུ་ཞི་བར་གྱུར། །
en: {64} “ ‘From your body you radiated light rays That illuminated the entire world, Eliminating all the darkness in beings And bringing to an end every kind of illness.

source: གནོད་སྦྱིན་གྲུལ་བུམ་ཤ་ཟ་མང་པོའི་ཚོགས། །རྣམ་པར་འཚེ་བ་དེ་དག་བསྩལ་བར་གྱུར། །
en: {65} “ ‘Those gatherings of yakṣas, kumbhāṇḍas, and piśācas Who were causing harm were dispelled.

source: ཤིན་ཏུ་གདུག་པས་སེམས་ཅན་འགུམ་པ་ཡི། །སྦྲུལ་གདུག་ཀུན་ཀྱང་དེ་ཚེ་ཡོངས་མི་རྒྱུ། །
en: All poisonous snakes, who with malicious intent Killed beings, were rendered immobile.

source: ཐོབ་མེད་སྨད་པ་མི་སྙན་སྡུག་བསྔལ་དང་། །ནད་རླུང་ནད་མང་གནོད་པར་འཚེ་བ་དག །མདོར་བསྡུ་ཀུན་ཀྱང་ཞི་ཞིང་མ་མཆིས་གྱུར། །འཇིག་རྟེན་ཀུན་ཏུ་རབ་དགའ་བྱུང་བར་གྱུར། །
en: {66} “ ‘The suffering of misfortune and disgrace, Being afflicted by illness, harmed by many illnesses All these were, in brief, brought to an end, ceased to exist, And there was great happiness throughout the entire world.

source: ཕན་ཚུན་མ་དང་འདྲ་བའི་འདུ་ཤེས་ཀྱིས། །ཁོང་ནས་བྱམས་པར་དེ་ཚེ་འགྲོ་ཀུན་གྱུར། །
en: {67} “ ‘At that time, all beings had loving minds, Perceiving one another as being like their mother.

source: ཤར་གཉེར་སེམས་བྲལ་འཚེ་བ་མ་མཆིས་ཏེ། །ཐམས་ཅད་མཁྱེན་ལམ་ནན་ཏན་ལྡན་པར་གྱུར། །
en: Without aggression and without violence, They practiced the path to omniscience.

source: ངན་སོང་རྒྱུད་རྣམས་རྣམ་པར་རབ་ཏུ་བཟློག །མཐོ་རིས་ལམ་ཆེན་ཀུན་ཀྱང་བཏོད་པར་གྱུར། །ཐམས་ཅད་མཁྱེན་པའི་ལམ་ཡང་ཤིན་ཏུ་བསྟན། །
en: {68} “ ‘They were turned away from the lower existences, Turned toward the great path to higher existences, And shown the path toward omniscience.

source: དེ་ལྟར་ཁྱོད་ཀྱིས་འགྲོ་དོན་ཡངས་པ་མཛད། །
en: In that way you created a vast benefit for beings.

source: རྒྱ་མཚོ་ཆེ་འདྲ་ཡོངས་སུ་གཏོང་མཛད་པ། །
en: {69} “ ‘Your generosity has been as vast as an ocean.

source: ཁྱོད་མཐོང་བདག་ནི་ཐོབ་པ་དམ་པ་ཐོབ། །
en: I have attained the excellent attainment of seeing you.

source: ཡུན་རིང་འཁྱམས་པའི་འགྲོ་བ་མགོན་བྲལ་དུ། །ཁྱོད་ནི་རྨད་དུ་བྱུང་བའི་མགོན་ཞིག་གཤེགས། །
en: You have come to be a marvelous guide For those who have been helplessly lost for a long time.’

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་མོ་རིན་ཆེན་འོད་ཀྱིས་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ་ལ་ཚིགས་སུ་བཅད་པ་དེ་དག་གིས་མངོན་པར་བསྟོད་དེ།
en: {70} “The head merchant’s daughter, Ratnaprabhā, praised King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa with those verses.

source: སྙན་པར་བཀུར་ནས་རབ་ཏུ་བསྔགས་ཏེ། ལན་བརྒྱ་ཕྲག་སྟོང་དུ་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ།
en: Having honored and praised him, she circumambulated him, keeping him to her right, a hundred thousand times.

source: ཕྱག་འཚལ་ནས་ཕྱོགས་གཅིག་ཏུ་གུས་པའི་ཚུལ་གྱིས་འདུག་གོ །
en: Having paid homage, she reverently went to sit to one side.

source: དེ་ནས་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པས། ཚོང་དཔོན་གྱི་བུ་མོ་རིན་ཆེན་འོད་ལ་བལྟས་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བུ་མོ་དེ་ལྟར་ཁྱོད་སེམས་ཅན་ཕ་རོལ་གྱི་ཡོན་ཏན་གྱི་ཁྱད་པར་ཤེས་པའི་མངོན་པར་ཤེས་པ་ལ་ཞུགས་པ་ལེགས་སོ་ལེགས་སོ། །
en: “King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa looked at the merchant’s daughter Ratnaprabhā and said these words: ‘Girl, it is excellent, excellent, that you have thus set out for the higher knowledge that knows the special qualities of other beings.

source: བུ་མོ་འཇིག་རྟེན་ཐམས་ཅད་ནའང་སེམས་ཅན་གང་སེམས་ཅན་ཕ་རོལ་གྱི་ཡོན་ཏན་ལ་མོས་པ་དེ་ལྟ་བུ་ནི་དཀོན་ཏེ། བུ་མོ་སེམས་ཅན་མུན་པས་བསྒྲིབས་པས་ཕན་བཏགས་པ་ལ་དྲིན་དུ་མི་གཟོ་བའི། བློ་ཕྱིན་ཅི་ལོག་ལ་ཞུགས་པ་སེམས་འཁྲུགས་པར་གྱུར་པ། རྒྱུད་འཛིངས་པར་གྱུར་པ། མུན་པའི་སེམས་དང་ལྡན་པ།
en: “ ‘Girl, beings who aspire for the good qualities in other beings are rare in all worlds.

source: བསམ་པ་ངང་གིས་ལོག་པ། ནན་ཏན་དང་མྱི་ལྡན་པ། སེམས་ཅན་ཕ་རོལ་གྱི་ཡོན་ཏན་གྱི་ཁྱད་པར་མངོན་པར་མི་ཤེས་པ་རྣམས་ཀྱིས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ལ་འཇུག་པར་བྱ་བའམ། དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་ལ་བརྟག་པར་བྱ་བའམ། ཡོན་ཏན་ཐམས་ཅད་ཤེས་པའི་ཁྱད་པར་མངོན་པར་ཤེས་པ་ཐོབ་པར་བྱ་བར་མི་ནུས་སོ། །
en: “ ‘Girl, beings who are obscured by darkness, who are ungrateful, who have wrong judgment, who have disturbed minds, whose trains of thought are in disorder, whose minds are in darkness, whose thoughts are naturally ruinous, who do not practice, and who do not know the special qualities of other beings are unable to comprehend the qualities of bodhisattvas, to conceive the qualities of the tathāgatas, or to attain the higher cognition that is the unique knowledge of all qualities.

source: བུ་མོ་དེ་ལྟར་ཁྱོད་སེམས་ཅན་ཆེན་པོ་མངོན་པར་ཤེས་པས་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་གྱི་རྣམ་པ་དེ་ལྟ་བུ་ལ་འཇུག་པ་ནི་གདོན་མི་ཟ་བར་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པའོ། །
en: “ ‘Therefore, girl, as you comprehend the qualities of the bodhisattvas through a higher cognition of great beings, you are, without doubt, established in the way to enlightenment.

source: དེ་ལྟར་ངའི་ཁམས་སུ་ཁྱོད་ལྟ་བུ་ཡེ་ཤེས་དེ་འདྲ་བ་དང་ལྡན་པ་སྐྱེས་པ་ནི། འཛམ་བུའི་གླིང་དུ་ངས་སེམས་ཅན་ཡོངས་སུ་བསྡུས་པའི་མཐུ་དོན་ཡོད་དོ། །
en: “ ‘My prowess in gathering together the beings of Jambudvīpa has proved meaningful because someone like you, with your kind of knowledge, has been born in my realm.’

source: དེ་ནས་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པས། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་རིན་ཐང་མེད་པ་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྐར་མའི་འོད་སྣ་ཚོགས་དང་། གོས་རིན་པོ་ཆེ་རིན་ཐང་མེད་པ་བདག་གིས་ལག་བདར་ཏེ་བླངས་ནས། ཚོང་དཔོན་གྱི་བུ་མོ་རིན་ཆེན་འོད་ལ་བྱིན་ནོ། །
en: “Then King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa picked up with his own hands a great, priceless, precious jewel, a multicolored precious jewel that contained the lights of the stars, and priceless, precious clothing, and gave them to the head merchant’s daughter Ratnaprabhā.

source: དེའི་འཁོར་གྱི་བུ་མོ་ཐམས་ཅད་ཀྱང་གོས་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་ཁྱེད་པར་བྱིན་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: He gave various precious clothing to each of the girls in Ratnaprabhā’s entourage.

source: བུ་མོ་གོས་རིན་པོ་ཆེ་འདི་ཁྱེར་ལ་བདག་གིས་ཡོངས་སུ་སྤྱད་པར་གྱིས་ཤིགདེ་ནས་ཚོང་དཔོན་གྱི་བུ་མོ་རིན་ཆེན་འོད་འཁོར་དང་བཅས་པས་པུས་མོ་གཉིས་ས་ལ་ཕབ་སྟེ།
en: He said, ‘Girl, take this precious clothing, keep it, and wear it yourself!’

source: གོས་རིན་པོ་ཆེ་དེ་དག་ལག་པ་གཉིས་ཀྱིས་བླངས་ནས་སྤྱི་པོ་ལ་བླངས་ཏེ།
en: “Then the head merchant’s daughter, Ratnaprabhā, accompanied by her entourage, knelt with both knees on the ground, took up the precious clothing with both hands, placed it on her head, withdrew, and put on that precious clothing.

source: ཕྱིར་ཕྱུང་ནས་གོས་རིན་པོ་ཆེ་དེ་དག་བགོས་སོ། །དེའི་འཁོར་གྱི་བུ་མོ་ཐམས་ཅད་ཀྱིས་ཀྱང་སོ་སོ་ནས་རང་རང་གི་གོས་རིན་པོ་ཆེ་དེ་དག་བགོས་ནས།
en: All the girls in the entourage also each put on their own precious clothing.

source: དེས་གོས་རིན་པོ་ཆེ་དེ་དག་བགོས་པའི་འོག་ཏུ་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ་ལ་བདག་གི་འཁོར་བུ་མོ་དེ་དག་དང་བཅས་པས་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་སོ། །
en: When she had put on that precious clothing, accompanied by her entourage of girls, she circumambulated King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa, keeping him to her right.

source: དེ་དག་ཐམས་ཅད་ཀྱི་གོས་རིན་པོ་ཆེ་དེ་དག་ལ་རྒྱུ་སྐར་དང་སྐར་མ་ཐམས་ཅད་ཀྱི་གཟུགས་བརྙན་སྣང་བར་གྱུར་ཏེ།
en: The images of all constellations and stars appeared on those precious clothes.

source: དེ་དག་མཐོང་ནས་འགྲོ་བའི་ཚོགས་མང་པོ་འདི་སྐད་ཅེས་འཛེར་ཏེ། བུ་མོ་ཁྱོད་ཀྱི་འཁོར་བུ་མོ་འདི་དག་ནི་མཚན་མོའི་ལྷ་མོ་སྐར་མའི་ཚོགས་ཀྱིས་བརྒྱན་པ་ལྟར་ཤིན་ཏུ་མཛེས་པ་སྟེ།
en: When the gathering of people saw her, they said, ‘Girl, your entourage of girls is as beautiful as a night goddess adorned by the stars.

source: ཁྱོད་དེ་དག་གིས་བསྐོར་བས་གྱ་ནོམ་པར་མཛེས་སོ། །
en: You, encircled by them, are even more beautiful.’ ”

source: དེ་ནས་མཚན་མོའི་ལྷ་མོ་ཤིང་ཐམས་ཅད་ཀྱི་མེ་ཏོག་རྒྱས་པས་བདེ་བར་གནས་པས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དེ་ལ་ཇི་སྙམ་དུ་སེམས།
en: Then the night goddess Sarva­vṛkṣpraphullana­sukha­saṃvāsā said to Sudhana, “Noble one, what do you think?

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ་ཞེས་བྱ་བ་བྱུང་བ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན། དེ་ལྟར་མྱི་བལྟ་སྟེ།
en: At that time, in that time, who was King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa?

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་སྣང་མཛད་འདི་ནི། དེའི་ཚེ་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Do not think that it was anyone else, for at that time, in that time, it was this bhagavat tathāgata arhat samyak­saṃbuddha Vairocana who was King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa.

source: རིགས་ཀྱི་བུ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་སྐར་མའི་འོད་ཀྱི་བཙུན་མོ་པདྨོའི་འོད་ཅེས་བྱ་བ་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པའི་ཡུམ་དུ་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་སེམས་ཅན་ཡང་དེ་ལྟར་མྱི་བལྟ་སྟེ།
en: “What do you think, noble one? At that time, in that time, who was Padmaprabhā, the queen of King Jyotiṣprabha and the mother of King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa?

source: ལྷ་མོ་སྒྱུ་མ་འདི་ནི་དེའི་ཚེ་རྒྱལ་པོ་བཙུན་མོ་པདྨོའི་འོད་ཅེས་བྱ་བར་གྱུར་ཏེ།
en: Do not think that it was anyone else, for at that time, in that time, Māyādevī was Padmaprabhā, the king’s queen who took the miraculously born prince onto her lap.

source: རྫུས་ཏེ་བྱུང་བའི་གཞོན་ནུ་ཐུ་བར་ལེན་ལེན་པའོ། །
en: “Also, what do you think, noble one?

source: ཡང་རིགས་ཀྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་སྐར་མའི་འོད་ཅེས་བྱ་བ་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པའི་ཡབ་དུ་གྱུར་པ།
en: At that time, in that time, who was Jyotiṣprabha, the father of King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa?
